# Напишите программу, которая получает целое число и возвращает его шестнадцатеричное строковое представление.
# Функцию hex используйте для проверки своего результата.

# number = int(input("Введите число для перевода в 16-ичную систему: "))
# BASE = 16
# original_number = number
# result = ""
# hex_digit = "0123456789abcdef"

# while number:
#     remainder = number%BASE
#     result = hex_digit[remainder] + result
#     number //= BASE
# print(f'Число {original_number} в {BASE}-ичной системе: {result}')
# print(f'Проверка функцией hex: {hex(original_number)[2:]}')